ryan.org
#+TITLE: Ryan Woodard's Emacs configuration
#+OPTIONS: toc:4 h:4

We dearly thank [[http://sachachua.com][Sacha Chua]] for [[http://sachachua.com/dotemacs][this file]], vision and general great
stuff.  She is wonderful.

* Preamble

** Which machine, OS

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; check OS type
  (setq is-linux nil)
  (setq is-mac nil)
  (cond
   ((string-equal system-type "darwin") ; Mac OS X
    (progn
      (message "Mac OS X")
      (setq is-mac t)))
   ((string-equal system-type "gnu/linux") ; linux
    (progn
      (message "Linux")
      (setq is-linux t))))
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; check emacs version
  (if (version< emacs-version "25.1")
      ((message "Old Emacs, YMMV")
       (kill-emacs))
    (message "Why not try 26.1?"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (message "Spinning up %s@%s using %s"
	   system-name
	   user-login-name
	   ;;user-emacs-directory
	   user-init-file)
#+END_SRC

** Readability

#+BEGIN_SRC emacs-lisp :tangle yes
   ;;  t for a termcap frame (a character-only terminal),
   ;; ‘x’ for an Emacs frame that is really an X window,
   ;; ‘w32’ for an Emacs frame that is a window on MS-Windows display,
   ;; ‘ns’ for an Emacs frame on a GNUstep or Macintosh Cocoa display,
#+END_SRC

All must be readable for when anything below crashes:

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Readability counts.
  ;; `C-x C-+’ and ‘C-x C--’
  ;; C-x C-0 to reset.
  (when (eq is-linux t)
    ;; Readable font
    (when (eq window-system 'x)
      (set-face-attribute 'default nil :height 260)
      (add-to-list 'initial-frame-alist '(height . 55))
      (add-to-list 'initial-frame-alist '(width . 80))
      (add-to-list 'default-frame-alist '(height . 55))
      (add-to-list 'default-frame-alist '(width . 80))))

  (when (eq is-mac t)

    ;; Macbook built-in display.
    (when (eq window-system 'ns)
      ;; On Mac, use Command-t to bring up font menu.
      (set-face-attribute 'default nil :height 240)
      (add-to-list 'initial-frame-alist '(height . 33))
      (add-to-list 'initial-frame-alist '(width . 80))
      (add-to-list 'default-frame-alist '(height . 33))
      (add-to-list 'default-frame-alist '(width . 80))))
#+END_SRC

Note that all the =#+BEGIN_SRC= blocks are indented in this =.org=
file but not in the tangled =.el= output.  Monkey around with that
using =org-edit-src-content-indentation= and
=org-src-preserve-indentation=. 

** It's all about the org

For me, everything is now about ~org mode~ and, therefore, keeping the
bleeding edge development github version, so I'm following:

http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development

My only difference is ~$HOME/.emacs.d/elisp~ instead of ~$HOME/elisp~.
Therefore, I:

#+BEGIN_SRC sh
  sudo apt-get install emacs25-common-non-dfsg install-info \
       texi2html texinfo texinfo-doc-nonfree
  mkdir $HOME/.emacs.d/elisp && cd $HOME/.emacs.d/elisp
  git clone git://orgmode.org/org-mode.git
  cd org-mode && make
#+END_SRC

Need to point to where updated Info is.  Need to do shell env hack:

#+BEGIN_SRC sh
export INFOPATH=$HOME/.emacs.d/elisp/org-mode/doc:$INFOPATH
#+END_SRC

even though the following [[http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development][from here]] should work (it doesn't seem to):

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Info directory
  (setq Info-additional-directory-list
	(cons (expand-file-name "~/.emacs.d/elisp/org-mode/doc")
	      Info-default-directory-list))
#+END_SRC

To update occasionally:

#+BEGIN_SRC sh
  cd $HOME/elisp/org-mode && make up2
  git log  # to see what has changed
  git gc  # to clean things up, keep dir smaller
#+END_SRC

* Configuration

