ryan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-24 Mon 18:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ryan Woodard's Emacs configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ryan Woodard" />
</head>
<body>
<div id="content">
<h1 class="title">Ryan Woodard's Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org565503a">1. Preamble</a>
<ul>
<li><a href="#orgbcd8342">1.1. Which machine, OS</a></li>
<li><a href="#org672ee06">1.2. Readability</a></li>
<li><a href="#orgc8d5458">1.3. It's all about the org</a></li>
</ul>
</li>
<li><a href="#org3688435">2. Configuration</a>
<ul>
<li><a href="#org56bb208">2.1. About this file</a></li>
<li><a href="#org847b4e9">2.2. Starting up</a></li>
<li><a href="#orgff3a115">2.3. Personal information</a></li>
<li><a href="#org23d4e64">2.4. Emacs initialization</a>
<ul>
<li><a href="#org6f6032a">2.4.1. Add package sources</a></li>
<li><a href="#org8dccaca">2.4.2. Add my elisp directory and other files</a></li>
<li><a href="#org74abbc6">2.4.3. Load secrets</a></li>
<li><a href="#org40a3dc4">2.4.4. Magit - nice git interface</a></li>
<li><a href="#org11aa060">2.4.5. Mode line format</a></li>
<li><a href="#org0495cbe">2.4.6. Change "yes or no" to "y or n"</a></li>
<li><a href="#org2b9d3df">2.4.7. Minibuffer editing - more space!</a></li>
<li><a href="#org953f213">2.4.8. Set up a light-on-dark color scheme</a></li>
<li><a href="#orgc2707c7">2.4.9. Some old favorite keys of mine (rw)</a></li>
<li><a href="#org6c65623">2.4.10. Bells and whistles, and menus</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1ab1f4d">3. Just trying things out</a>
<ul>
<li><a href="#orga73c2bc">3.1. org mode structure templates (<code>&lt;s</code> things)</a></li>
</ul>
</li>
<li><a href="#org9e10be4">4. Make sure source code packages (org) have latest Info</a></li>
<li><a href="#org95c3bbd">5. Python</a></li>
</ul>
</div>
</div>
<p>
We dearly thank <a href="http://sachachua.com">Sacha Chua</a> for <a href="http://sachachua.com/dotemacs">this file</a>, vision and general great
stuff.  She is wonderful.
</p>

<div id="outline-container-org565503a" class="outline-2">
<h2 id="org565503a"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbcd8342" class="outline-3">
<h3 id="orgbcd8342"><span class="section-number-3">1.1</span> Which machine, OS</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">check OS type</span>
(<span style="color: #859900;">setq</span> is-linux nil)
(<span style="color: #859900;">setq</span> is-mac nil)
(<span style="color: #859900;">cond</span>
 ((string-equal system-type <span style="color: #2aa198; background-color: #000000;">"darwin"</span>) <span style="color: #586e75; font-style: italic;">; </span><span style="color: #586e75; font-style: italic;">Mac OS X</span>
  (<span style="color: #859900;">progn</span>
    (message <span style="color: #2aa198; background-color: #000000;">"Mac OS X"</span>)
    (<span style="color: #859900;">setq</span> is-mac t)))
 ((string-equal system-type <span style="color: #2aa198; background-color: #000000;">"gnu/linux"</span>) <span style="color: #586e75; font-style: italic;">; </span><span style="color: #586e75; font-style: italic;">linux</span>
  (<span style="color: #859900;">progn</span>
    (message <span style="color: #2aa198; background-color: #000000;">"Linux"</span>)
    (<span style="color: #859900;">setq</span> is-linux t))))
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">check emacs version</span>
(<span style="color: #859900;">if</span> (version&lt; emacs-version <span style="color: #2aa198; background-color: #000000;">"25.1"</span>)
    ((message <span style="color: #2aa198; background-color: #000000;">"Old Emacs, YMMV"</span>)
     (kill-emacs))
  (message <span style="color: #2aa198; background-color: #000000;">"Why not try 26.1?"</span>))
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(message <span style="color: #2aa198; background-color: #000000;">"Spinning up %s@%s using %s"</span>
         system-name
         user-login-name
         <span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">user-emacs-directory</span>
         user-init-file)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org672ee06" class="outline-3">
<h3 id="org672ee06"><span class="section-number-3">1.2</span> Readability</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;;  </span><span style="color: #586e75; font-style: italic;">t for a termcap frame (a character-only terminal),</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">&#8216;x&#8217; for an Emacs frame that is really an X window,</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">&#8216;</span><span style="color: #586e75; font-style: italic;">w32</span><span style="color: #586e75; font-style: italic;">&#8217; for an Emacs frame that is a window on MS-Windows display,</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">&#8216;</span><span style="color: #586e75; font-style: italic;">ns</span><span style="color: #586e75; font-style: italic;">&#8217; for an Emacs frame on a GNUstep or Macintosh Cocoa display,</span>
</code></pre>
</div>

<p>
All must be readable for when anything below crashes:
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Readability counts.</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">`C-x C-+&#8217; and &#8216;C-x C--&#8217;</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">C-x C-0 to reset.</span>
(<span style="color: #859900;">when</span> (eq is-linux t)
  <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Readable font</span>
  (set-face-attribute 'default nil <span style="color: #859900;">:height</span> 260)
  )

(<span style="color: #859900;">when</span> (eq is-mac t)

  <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Macbook built-in display.</span>
  (<span style="color: #859900;">when</span> (eq window-system 'ns)
    <span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">On Mac, use Command-t to bring up font menu.</span>
    (set-face-attribute 'default nil <span style="color: #859900;">:height</span> 240)
    (add-to-list 'initial-frame-alist '(height . 33))
    (add-to-list 'initial-frame-alist '(width . 80))
    (add-to-list 'default-frame-alist '(height . 33))
    (add-to-list 'default-frame-alist '(width . 80))))
</code></pre>
</div>

<p>
Note that all the <code>#+BEGIN_SRC</code> blocks are indented in this <code>.org</code>
file but not in the tangled <code>.el</code> output.  Monkey around with that
using <code>org-edit-src-content-indentation</code> and
<code>org-src-preserve-indentation</code>. 
</p>
</div>
</div>

<div id="outline-container-orgc8d5458" class="outline-3">
<h3 id="orgc8d5458"><span class="section-number-3">1.3</span> It's all about the org</h3>
<div class="outline-text-3" id="text-1-3">
<p>
For me, everything is now about <code>org mode</code> and, therefore, keeping the
bleeding edge development github version, so I'm following:
</p>

<p>
<a href="http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development">http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development</a>
</p>

<p>
My only difference is <code>$HOME/.emacs.d/elisp</code> instead of <code>$HOME/elisp</code>.
Therefore, I:
</p>

<div class="org-src-container">
<pre><code class="src src-sh">sudo apt-get install emacs25-common-non-dfsg install-info <span style="color: #2aa198; background-color: #000000;">\</span>
     texi2html texinfo texinfo-doc-nonfree
mkdir $<span style="color: #268bd2;">HOME</span>/.emacs.d/elisp &amp;&amp; <span style="color: #859900;">cd</span> $<span style="color: #268bd2;">HOME</span>/.emacs.d/elisp
git clone git://orgmode.org/org-mode.git
<span style="color: #859900;">cd</span> org-mode &amp;&amp; make
</code></pre>
</div>

<p>
Need to point to where updated Info is.  Need to do shell env hack:
</p>

<div class="org-src-container">
<pre><code class="src src-sh"><span style="color: #859900;">export</span> <span style="color: #268bd2;">INFOPATH</span>=$<span style="color: #268bd2;">HOME</span>/.emacs.d/elisp/org-mode/doc:$<span style="color: #268bd2;">INFOPATH</span>
</code></pre>
</div>

<p>
even though the following <a href="http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development">from here</a> should work (it doesn't seem to):
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Info directory</span>
(<span style="color: #859900;">setq</span> Info-additional-directory-list
      (cons (expand-file-name <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/elisp/org-mode/doc"</span>)
            Info-default-directory-list))
</code></pre>
</div>

<p>
To update occasionally:
</p>

<div class="org-src-container">
<pre><code class="src src-sh"><span style="color: #859900;">cd</span> $<span style="color: #268bd2;">HOME</span>/elisp/org-mode &amp;&amp; make up2
git log  <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">to see what has changed</span>
git gc  <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">to clean things up, keep dir smaller</span>
</code></pre>
</div>
</div>
</div>
</div>
