ryan.org
** About this file

See http://sachachua.com/dotemacs for Sacha's great explanations!
From that file:

#+BEGIN_QUOTE
My =~/.emacs.d/init.el= is now a symlink to =Sacha.el=, which is what
=M-x org-babel-tangle= (=C-c C-v t=) produces. *A note about Org
updates:* I like running Org Mode from checked-out source code instead
of package.el. I add the Lisp directories to my =load-path=, and I
also use the =:load-path= option in my first =use-package org= call to
set the load path. One of those is probably doing the trick and the
other one is redundant, but maybe it's a belt-and-suspenders sort of
thing. Using the git checkout also makes upgrading Org easy. All I
have to do is =git pull; make=, and stuff happens in an external Emacs
process. Since I create =Sacha.el= via =org-babel-tangle=, my Emacs
config can load =Sacha.el= without loading Org first.
#+END_QUOTE

** Starting up

Here's how we start:

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; This sets up the load path so that we can override it
  (package-initialize)

  ;; Override the packages with the git version of Org and other packages
  (add-to-list 'load-path "~/.emacs.d/elisp/org-mode/lisp")
  (add-to-list 'load-path "~/.emacs.d/elisp/org-mode/contrib/lisp")
  (setq package-enable-at-startup nil)
  (setq custom-file "~/.emacs.d/custom-settings.el")
  (load custom-file t)
#+END_SRC

** Personal information

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Who am I?
  (setq user-full-name "Ryan Woodard")
  (when (eq user-login-name "ryan")
    (setq user-mail-address "ryan@timehaven.org"))
  (when (eq user-login-name "rwoodard")
    (setq user-mail-address "rwoodard@appnexus.com"))
#+END_SRC

#+RESULTS:

** Emacs initialization

*** Add package sources

#+BEGIN_SRC emacs-lisp :tangle yes
    ;; Modern emacs packaging.
    (unless (assoc-default "melpa" package-archives)
      (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
      (add-to-list 'package-archives '("elpy" . "https://jorgenschaefer.github.io/packages/"))
      ;;(package-refresh-contents)
    )
    ;;       '(("GNU ELPA"     . "http://elpa.gnu.org/packages/")
    ;;         ("MELPA Stable" . "https://stable.melpa.org/packages/")
    ;;         ("MELPA"        . "https://melpa.org/packages/"))
    ;;       package-archive-priorities
    ;;       '(("MELPA Stable" . 0)
    ;;         ("GNU ELPA"     . 5)
    ;;         ("MELPA"        . 10)))
    ;; (when (not package-archive-contents)
    ;;   (package-refresh-contents))

#+END_SRC

Since it can take long and be annoying at start up, it's commented out
above.../but/ use =M-x package-refresh-contents= to reload the list of
packages after adding these for the first time.

*** Add my elisp directory and other files

Sometimes I load files outside the package system. As long as they're
in a directory in my =load-path=, Emacs can find them.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'load-path "~/.emacs.d/elisp")

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (setq use-package-verbose t)
  (setq use-package-always-ensure t)

  (require 'use-package)

  (use-package auto-compile
    :config (auto-compile-on-load-mode))

  (setq load-prefer-newer t)
#+END_SRC

*** Load secrets

I keep slightly more sensitive information in a separate file so that
I can easily publish my main configuration.

#+BEGIN_SRC emacs-lisp :tangle yes
  (load "~/.emacs.secrets" t)
#+END_SRC

** org
#+begin_src emacs-lisp :tangle yes
  (setq org-startup-with-inline-images t)
#+end_src

See Sacha's things to really get this down.

("'append" is for ipython, scimax stuff down below.)

#+begin_src emacs-lisp :tangle yes
  (setq org-startup-with-inline-images t)
  (use-package org
    :load-path "~/.emacs.d/elisp/org-mode/lisp"
    :config
    (progn
      (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
      (org-babel-do-load-languages
       'org-babel-load-languages
       '(
	 ;; (dot . t)
	 ;;   (ditaa . t)
	 (emacs-lisp . t)
	 (ipython . t)
	 (sh . t)
	 ;; (sqlite . t)
	 ;; (http . t)
	 ;; (ledger . t)
	 (shell . t)
	 ;; (R . t)))
	 ))
    (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))))
    ;;:config
#+end_src

*** Literate programming

Sacha doesn't want to get distracted by the same code in the other
window, so I want org src to use the current window.

#+begin_src emacs-lisp :tangle yes
  (setq org-src-window-setup 'current-window)
#+end_src

** More init
*** Magit - nice git interface

#+begin_src emacs-lisp :tangle yes
  (use-package magit)
  (global-set-key (kbd "C-x g") 'magit-status)
  (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
  (setq global-magit-file-mode t)
#+end_src

*** Mode line format

Display a more compact mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smart-mode-line)
#+END_SRC

*** Change "yes or no" to "y or n"

Lazy people like me never want to type "yes" when "y" will suffice.

#+BEGIN_SRC emacs-lisp :tangle yes
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

*** Minibuffer editing - more space!

Sometimes you want to be able to do fancy things with the text that
you're entering into the minibuffer. Sometimes you just want to be
able to read it, especially when it comes to lots of text.  This binds
=C-M-e= in a minibuffer) so that you can edit the contents of the
minibuffer before submitting it.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package miniedit
  :commands minibuffer-edit
  :init (miniedit-install))
#+END_SRC

