ryan.html

<div id="outline-container-org3688435" class="outline-2">
<h2 id="org3688435"><span class="section-number-2">2</span> Configuration</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org56bb208" class="outline-3">
<h3 id="org56bb208"><span class="section-number-3">2.1</span> About this file</h3>
<div class="outline-text-3" id="text-2-1">
<p>
See <a href="http://sachachua.com/dotemacs">http://sachachua.com/dotemacs</a> for Sacha's great explanations!
From that file:
</p>

<blockquote>
<p>
My <code>~/.emacs.d/init.el</code> is now a symlink to <code>Sacha.el</code>, which is what
<code>M-x org-babel-tangle</code> (<code>C-c C-v t</code>) produces. <b>A note about Org
updates:</b> I like running Org Mode from checked-out source code instead
of package.el. I add the Lisp directories to my <code>load-path</code>, and I
also use the <code>:load-path</code> option in my first <code>use-package org</code> call to
set the load path. One of those is probably doing the trick and the
other one is redundant, but maybe it's a belt-and-suspenders sort of
thing. Using the git checkout also makes upgrading Org easy. All I
have to do is <code>git pull; make</code>, and stuff happens in an external Emacs
process. Since I create <code>Sacha.el</code> via <code>org-babel-tangle</code>, my Emacs
config can load <code>Sacha.el</code> without loading Org first.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org847b4e9" class="outline-3">
<h3 id="org847b4e9"><span class="section-number-3">2.2</span> Starting up</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Here's how we start:
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">This sets up the load path so that we can override it</span>
(package-initialize)

<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Override the packages with the git version of Org and other packages</span>
(add-to-list 'load-path <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/elisp/org-mode/lisp"</span>)
(add-to-list 'load-path <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/elisp/org-mode/contrib/lisp"</span>)
(<span style="color: #859900;">setq</span> package-enable-at-startup nil)
(<span style="color: #859900;">setq</span> custom-file <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/custom-settings.el"</span>)
(load custom-file t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgff3a115" class="outline-3">
<h3 id="orgff3a115"><span class="section-number-3">2.3</span> Personal information</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Who am I?</span>
(<span style="color: #859900;">setq</span> user-full-name <span style="color: #2aa198; background-color: #000000;">"Ryan Woodard"</span>
      user-mail-address <span style="color: #2aa198; background-color: #000000;">"ryan@timehaven.org"</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org23d4e64" class="outline-3">
<h3 id="org23d4e64"><span class="section-number-3">2.4</span> Emacs initialization</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org6f6032a" class="outline-4">
<h4 id="org6f6032a"><span class="section-number-4">2.4.1</span> Add package sources</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Modern emacs packaging.</span>
(<span style="color: #859900;">unless</span> (assoc-default <span style="color: #2aa198; background-color: #000000;">"melpa"</span> package-archives)
  (add-to-list 'package-archives '(<span style="color: #2aa198; background-color: #000000;">"melpa"</span> . <span style="color: #2aa198; background-color: #000000;">"http://melpa.org/packages/"</span>) t)
  <span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">(package-refresh-contents)</span>
)

<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">(setq package-archives</span>
<span style="color: #586e75; font-style: italic;">;;       </span><span style="color: #586e75; font-style: italic;">'(("GNU ELPA"     . "http://elpa.gnu.org/packages/")</span>
<span style="color: #586e75; font-style: italic;">;;         </span><span style="color: #586e75; font-style: italic;">("MELPA Stable" . "https://stable.melpa.org/packages/")</span>
<span style="color: #586e75; font-style: italic;">;;         </span><span style="color: #586e75; font-style: italic;">("MELPA"        . "https://melpa.org/packages/"))</span>
<span style="color: #586e75; font-style: italic;">;;       </span><span style="color: #586e75; font-style: italic;">package-archive-priorities</span>
<span style="color: #586e75; font-style: italic;">;;       </span><span style="color: #586e75; font-style: italic;">'(("MELPA Stable" . 0)</span>
<span style="color: #586e75; font-style: italic;">;;         </span><span style="color: #586e75; font-style: italic;">("GNU ELPA"     . 5)</span>
<span style="color: #586e75; font-style: italic;">;;         </span><span style="color: #586e75; font-style: italic;">("MELPA"        . 10)))</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">(when (not package-archive-contents)</span>
<span style="color: #586e75; font-style: italic;">;;   </span><span style="color: #586e75; font-style: italic;">(package-refresh-contents))</span>
</code></pre>
</div>

<p>
Since it can take long and be annoying at start up, it's commented out
above&#x2026;/but/ use <code>M-x package-refresh-contents</code> to reload the list of
packages after adding these for the first time.
</p>
</div>
</div>

<div id="outline-container-org8dccaca" class="outline-4">
<h4 id="org8dccaca"><span class="section-number-4">2.4.2</span> Add my elisp directory and other files</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Sometimes I load files outside the package system. As long as they're
in a directory in my <code>load-path</code>, Emacs can find them.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/elisp"</span>)

(<span style="color: #859900;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))

(<span style="color: #859900;">setq</span> use-package-verbose t)
(<span style="color: #859900;">setq</span> use-package-always-ensure t)

(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">use-package</span>)

(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">auto-compile</span>
  <span style="color: #859900;">:config</span> (auto-compile-on-load-mode))

(<span style="color: #859900;">setq</span> load-prefer-newer t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org74abbc6" class="outline-4">
<h4 id="org74abbc6"><span class="section-number-4">2.4.3</span> Load secrets</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
I keep slightly more sensitive information in a separate file so that
I can easily publish my main configuration.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(load <span style="color: #2aa198; background-color: #000000;">"~/.emacs.secrets"</span> t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org40a3dc4" class="outline-4">
<h4 id="org40a3dc4"><span class="section-number-4">2.4.4</span> Magit - nice git interface</h4>
<div class="outline-text-4" id="text-2-4-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">magit</span>)
(global-set-key (kbd <span style="color: #2aa198; background-color: #000000;">"C-x g"</span>) 'magit-status)
(global-set-key (kbd <span style="color: #2aa198; background-color: #000000;">"C-x M-g"</span>) 'magit-dispatch-popup)
(<span style="color: #859900;">setq</span> global-magit-file-mode t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org11aa060" class="outline-4">
<h4 id="org11aa060"><span class="section-number-4">2.4.5</span> Mode line format</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
Display a more compact mode line
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">smart-mode-line</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org0495cbe" class="outline-4">
<h4 id="org0495cbe"><span class="section-number-4">2.4.6</span> Change "yes or no" to "y or n"</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
Lazy people like me never want to type "yes" when "y" will suffice.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org2b9d3df" class="outline-4">
<h4 id="org2b9d3df"><span class="section-number-4">2.4.7</span> Minibuffer editing - more space!</h4>
<div class="outline-text-4" id="text-2-4-7">
<p>
Sometimes you want to be able to do fancy things with the text that
you're entering into the minibuffer. Sometimes you just want to be
able to read it, especially when it comes to lots of text.  This binds
<code>C-M-e</code> in a minibuffer) so that you can edit the contents of the
minibuffer before submitting it.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">miniedit</span>
  <span style="color: #859900;">:commands</span> minibuffer-edit
  <span style="color: #859900;">:init</span> (miniedit-install))
</code></pre>
</div>
</div>
</div>
