ryan.org
*** Set up a light-on-dark color scheme

I like light on dark because I find it to be more restful. The
color-theme in ELPA was a little odd, though, so we define some advice
to make it work. Some things still aren't quite right.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; (defadvice color-theme-alist (around sacha activate)
  ;;   (if (ad-get-arg 0)
  ;;       ad-do-it
  ;;     nil))
  (use-package color-theme)
  (use-package color-theme-solarized)
  (defun my/setup-color-theme ()
    (interactive)
    (color-theme-solarized-dark)
    (set-face-foreground 'secondary-selection "darkblue")
    (set-face-background 'secondary-selection "lightblue")
    (set-face-background 'font-lock-doc-face "black")
    (set-face-foreground 'font-lock-doc-face "wheat")
    (set-face-background 'font-lock-string-face "black")
    (set-face-foreground 'org-todo "green")
    (set-face-background 'org-todo "black"))

  (eval-after-load 'color-theme (my/setup-color-theme))
#+END_SRC

I sometimes need to switch to a lighter background for screenshots.
For that, I use =color-theme-vim=.

Some more tweaks to solarized:

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system
    (custom-set-faces
     '(erc-input-face ((t (:foreground "antique white"))))
     '(helm-selection ((t (:background "ForestGreen" :foreground "black"))))
     '(org-agenda-clocking ((t (:inherit secondary-selection :foreground "black"))) t)
     '(org-agenda-done ((t (:foreground "dim gray" :strike-through nil))))
     '(org-done ((t (:foreground "PaleGreen" :weight normal :strike-through t))))
     '(org-clock-overlay ((t (:background "SkyBlue4" :foreground "black"))))
     '(org-headline-done ((((class color) (min-colors 16) (background dark)) (:foreground "LightSalmon" :strike-through t))))
     '(outline-1 ((t (:inherit font-lock-function-name-face :foreground "cornflower blue"))))))
#+END_SRC

*** Some old favorite keys of mine (rw)

Add to 

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-load 'org
  '(define-key org-src-mode-map (kbd "S-<f12>") 'org-edit-src-exit))
  (eval-after-load 'org
  '(define-key org-mode-map (kbd "S-<f12>") 'org-edit-special))
  (eval-after-load 'org
  '(define-key org-mode-map (kbd "<f12>") 'org-ctrl-c-ctrl-c))
#+END_SRC

#+RESULTS:
: org-ctrl-c-ctrl-c
    
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f12>") 'eval-last-sexp)
#+END_SRC

For historical reasons, until I change it:

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; My stuff.
  ;; Function keys
  (add-to-list 'load-path "~/.emacs.d/rw")
  ;; (load-library "rw_funcs")
  (load-library "rw_keys")
#+END_SRC

*** Bells and whistles, and menus

Especially on Mac, audible bell is *annoying*!

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq visible-bell t)
#+END_SRC

* Just trying things out

** Unfill paragraph
#+BEGIN_SRC emacs-lisp :tangle yes
;;; Stefan Monnier <foo at acm.org>. It is the opposite of fill-paragraph    
    (defun unfill-paragraph (&optional region)
      "Takes a multi-line paragraph and makes it into a single line of text."
      (interactive (progn (barf-if-buffer-read-only) '(t)))
      (let ((fill-column (point-max))
            ;; This would override `fill-column' if it's an integer.
            (emacs-lisp-docstring-fill-column t))
        (fill-paragraph nil region)))
#+END_SRC

#+RESULTS:
: unfill-paragraph

** org mode structure templates (=<s= things)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-structure-template-alist
	'(("s" "#+BEGIN_SRC ?\n\n#+END_SRC" "<src lang=\"?\">\n\n</src>")
          ("e" "#+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE" "<example>\n?\n</example>")
          ("q" "#+BEGIN_QUOTE\n?\n#+END_QUOTE" "<quote>\n?\n</quote>")
          ("v" "#+BEGIN_VERSE\n?\n#+END_VERSE" "<verse>\n?\n</verse>")
          ("c" "#+BEGIN_COMMENT\n?\n#+END_COMMENT")
	  ("p" "#+BEGIN_SRC ipython\n?\n#+END_SRC" "<src lang=\"ipython\">\n?\n</src>")
          ;;("p" "#+BEGIN_PRACTICE\n?\n#+END_PRACTICE")
          ("l" "#+BEGIN_SRC emacs-lisp :tangle yes\n?\n#+END_SRC" "<src lang=\"emacs-lisp\">\n?\n</src>")
          ("L" "#+latex: " "<literal style=\"latex\">?</literal>")
          ("h" "#+BEGIN_HTML\n?\n#+END_HTML" "<literal style=\"html\">\n?\n</literal>")
          ("H" "#+html: " "<literal style=\"html\">?</literal>")
          ("a" "#+BEGIN_ASCII\n?\n#+END_ASCII")
          ("A" "#+ascii: ")
          ("i" "#+index: ?" "#+index: ?")
          ("I" "#+include %file ?" "<include file=%file markup=\"?\">")))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Sacha says: "Since Helm can be a little complex, you may want to
  ;; start with ido-mode instead."
  (ido-mode 1)
#+END_SRC

