ryan.html

<div id="outline-container-org953f213" class="outline-4">
<h4 id="org953f213"><span class="section-number-4">2.4.8</span> Set up a light-on-dark color scheme</h4>
<div class="outline-text-4" id="text-2-4-8">
<p>
I like light on dark because I find it to be more restful. The
color-theme in ELPA was a little odd, though, so we define some advice
to make it work. Some things still aren't quite right.
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">(defadvice color-theme-alist (around sacha activate)</span>
<span style="color: #586e75; font-style: italic;">;;   </span><span style="color: #586e75; font-style: italic;">(if (ad-get-arg 0)</span>
<span style="color: #586e75; font-style: italic;">;;       </span><span style="color: #586e75; font-style: italic;">ad-do-it</span>
<span style="color: #586e75; font-style: italic;">;;     </span><span style="color: #586e75; font-style: italic;">nil))</span>
(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">color-theme</span>)
(<span style="color: #859900;">use-package</span> <span style="color: #2aa198;">color-theme-solarized</span>)
(<span style="color: #859900;">defun</span> <span style="color: #268bd2;">my/setup-color-theme</span> ()
  (<span style="color: #859900;">interactive</span>)
  (color-theme-solarized-dark)
  (set-face-foreground 'secondary-selection <span style="color: #2aa198; background-color: #000000;">"darkblue"</span>)
  (set-face-background 'secondary-selection <span style="color: #2aa198; background-color: #000000;">"lightblue"</span>)
  (set-face-background 'font-lock-doc-face <span style="color: #2aa198; background-color: #000000;">"black"</span>)
  (set-face-foreground 'font-lock-doc-face <span style="color: #2aa198; background-color: #000000;">"wheat"</span>)
  (set-face-background 'font-lock-string-face <span style="color: #2aa198; background-color: #000000;">"black"</span>)
  (set-face-foreground 'org-todo <span style="color: #2aa198; background-color: #000000;">"green"</span>)
  (set-face-background 'org-todo <span style="color: #2aa198; background-color: #000000;">"black"</span>))

(eval-after-load 'color-theme (my/setup-color-theme))
</code></pre>
</div>

<p>
I sometimes need to switch to a lighter background for screenshots.
For that, I use <code>color-theme-vim</code>.
</p>

<p>
Some more tweaks to solarized:
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">when</span> window-system
  (custom-set-faces
   '(erc-input-face ((t (<span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"antique white"</span>))))
   '(helm-selection ((t (<span style="color: #859900;">:background</span> <span style="color: #2aa198; background-color: #000000;">"ForestGreen"</span> <span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"black"</span>))))
   '(org-agenda-clocking ((t (<span style="color: #859900;">:inherit</span> secondary-selection <span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"black"</span>))) t)
   '(org-agenda-done ((t (<span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"dim gray"</span> <span style="color: #859900;">:strike-through</span> nil))))
   '(org-done ((t (<span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"PaleGreen"</span> <span style="color: #859900;">:weight</span> normal <span style="color: #859900;">:strike-through</span> t))))
   '(org-clock-overlay ((t (<span style="color: #859900;">:background</span> <span style="color: #2aa198; background-color: #000000;">"SkyBlue4"</span> <span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"black"</span>))))
   '(org-headline-done ((((class color) (min-colors 16) (background dark)) (<span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"LightSalmon"</span> <span style="color: #859900;">:strike-through</span> t))))
   '(outline-1 ((t (<span style="color: #859900;">:inherit</span> font-lock-function-name-face <span style="color: #859900;">:foreground</span> <span style="color: #2aa198; background-color: #000000;">"cornflower blue"</span>))))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgc2707c7" class="outline-4">
<h4 id="orgc2707c7"><span class="section-number-4">2.4.9</span> Some old favorite keys of mine (rw)</h4>
<div class="outline-text-4" id="text-2-4-9">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #2aa198; background-color: #000000;">"&lt;f12&gt;"</span>) 'eval-last-sexp)
</code></pre>
</div>

<p>
For historical reasons, until I change it:
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">My stuff.</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Function keys</span>
(add-to-list 'load-path <span style="color: #2aa198; background-color: #000000;">"~/.emacs.d/rw"</span>)
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">(load-library "rw_funcs")</span>
(load-library <span style="color: #2aa198; background-color: #000000;">"rw_keys"</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org6c65623" class="outline-4">
<h4 id="org6c65623"><span class="section-number-4">2.4.10</span> Bells and whistles, and menus</h4>
<div class="outline-text-4" id="text-2-4-10">
<p>
Especially on Mac, audible bell is <b>annoying</b>!
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> visible-bell t)
</code></pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ab1f4d" class="outline-2">
<h2 id="org1ab1f4d"><span class="section-number-2">3</span> Just trying things out</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga73c2bc" class="outline-3">
<h3 id="orga73c2bc"><span class="section-number-3">3.1</span> org mode structure templates (<code>&lt;s</code> things)</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> org-structure-template-alist
      '((<span style="color: #2aa198; background-color: #000000;">"s"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_SRC ?\n\n#+END_SRC"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;src lang=\"?\"&gt;\n\n&lt;/src&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"e"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;example&gt;\n?\n&lt;/example&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"q"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_QUOTE\n?\n#+END_QUOTE"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;quote&gt;\n?\n&lt;/quote&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"v"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_VERSE\n?\n#+END_VERSE"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;verse&gt;\n?\n&lt;/verse&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"c"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_COMMENT\n?\n#+END_COMMENT"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"p"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_SRC ipython\n?\n#+END_SRC"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;src lang=\"ipython\"&gt;\n?\n&lt;/src&gt;"</span>)
        <span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">("p" "#+BEGIN_PRACTICE\n?\n#+END_PRACTICE")</span>
        (<span style="color: #2aa198; background-color: #000000;">"l"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_SRC emacs-lisp :tangle yes\n?\n#+END_SRC"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;src lang=\"emacs-lisp\"&gt;\n?\n&lt;/src&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"L"</span> <span style="color: #2aa198; background-color: #000000;">"#+latex: "</span> <span style="color: #2aa198; background-color: #000000;">"&lt;literal style=\"latex\"&gt;?&lt;/literal&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"h"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_HTML\n?\n#+END_HTML"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;literal style=\"html\"&gt;\n?\n&lt;/literal&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"H"</span> <span style="color: #2aa198; background-color: #000000;">"#+html: "</span> <span style="color: #2aa198; background-color: #000000;">"&lt;literal style=\"html\"&gt;?&lt;/literal&gt;"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"a"</span> <span style="color: #2aa198; background-color: #000000;">"#+BEGIN_ASCII\n?\n#+END_ASCII"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"A"</span> <span style="color: #2aa198; background-color: #000000;">"#+ascii: "</span>)
        (<span style="color: #2aa198; background-color: #000000;">"i"</span> <span style="color: #2aa198; background-color: #000000;">"#+index: ?"</span> <span style="color: #2aa198; background-color: #000000;">"#+index: ?"</span>)
        (<span style="color: #2aa198; background-color: #000000;">"I"</span> <span style="color: #2aa198; background-color: #000000;">"#+include %file ?"</span> <span style="color: #2aa198; background-color: #000000;">"&lt;include file=%file markup=\"?\"&gt;"</span>)))
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">Sacha says: "Since Helm can be a little complex, you may want to</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">start with ido-mode instead."</span>
(ido-mode 1)
</code></pre>
</div>
</div>
</div>
</div>
