ryan.org
* Make sure source code packages (org) have latest Info

Need to do this again because =magit= (from =elpa=) overwrites
previous attempt at this. 

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq Info-directory-list
	(cons (expand-file-name "~/.emacs.d/elisp/org-mode/doc")
	      Info-directory-list))
#+END_SRC
* Python

#+BEGIN_SRC sh
  cd ~/.emacs.d/elisp
  git clone https://github.com/jkitchin/scimax.git
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package elpy)
  (elpy-enable)

  (require 'ob-ipython)

  ;; Use conda env in shell from which Emacs was started!
  ;;(setq ob-ipython-command "~/local/miniconda3/envs/py27/bin/jupyter")

  ;; see org-babel stuff for ipython in Org section above

  ;; http://kitchingroup.cheme.cmu.edu/blog/2017/01/29/ob-ipython-and-inline-figures-in-org-mode/#disqus_thread
  ;; Intermittent silliness!
  ;;(require 'cl-lib)  ;; Might be needed with 'loop' error.
  (add-to-list 'load-path "~/.emacs.d/elisp/scimax")
  (require 'scimax-org-babel-ipython)
#+END_SRC

#+RESULTS:
: scimax-org-babel-ipython

#+BEGIN_SRC ipython :session :results output drawer
  print("hi there, sir")
  print
#+END_SRC

#+RESULTS:
:RESULTS:
hi there, sir

:END:

:END:
